Revit 2026 API

# AnalyticalMemberGetMemberForces Method

---

Gets the member forces associated with this Analytical Member.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<MemberForces> GetMemberForces()
```
```vb
Public Function GetMemberForces As IList(Of MemberForces)
```
```cpp
public:
IList<MemberForces^>^ GetMemberForces()
```
```fsharp
member GetMemberForces : unit -> IList<MemberForces>
```

#### Return Value

IListMemberForces Returns a collection of Member Forces associated with this Analytical Member. Empty collection will be returned if Analytical Member doesn't have any Member Forces. To find out with which end member forces are associated use [!:Autodesk::Revit::DB::Structure::MemberForces::Position] property to obtain a position of Member Forces on element.

Member forces are strictly related with releases. This means that we can obtain member forces values only for directions that have releases set to false. Force or moment component on direction that have release set to true is skipped (zeroed) during getting.

#### Reference

AnalyticalMember Class

Autodesk.Revit.DB.Structure Namespace